In [12]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [13]:
k = ['khalid','ahmad','omar']
s = pd.Series(k,index=[1,2,3])
s

1    khalid
2     ahmad
3      omar
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [14]:
s.index = [11,12,13]
s

11    khalid
12     ahmad
13      omar
dtype: object

## Q3: Retrieve First and second elements.

In [15]:
s[:2]

C:\Users\khali\AppData\Local\Temp\ipykernel_13552\3584294572.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  s[:2]

11    khalid
12     ahmad
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [19]:
k = ['khalid']
sn = pd.Series(k,index = [14])
s = s.append( sn )
s
s.drop_duplicates()
s

C:\Users\khali\AppData\Local\Temp\ipykernel_13552\3610395146.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s = s.append( sn )

11    khalid
12     ahmad
13      omar
14    khalid
14    khalid
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [29]:
 stu={
    "id": [1,2,3],
    "name": ['khalid','ahmad','saeed']

 }

dataframe = pd.DataFrame(stu,columns=['id','name'])
dataframe

   id    name
0   1  khalid
1   2   ahmad
2   3   saeed

## Q6: Read educ_figdp_1_Data.csv file

In [28]:
df = pd.read_csv("educ_figdp_1_Data.csv")
df

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [ ]:
'''- loc use the index labels as references
- slice use the position as references'''